module Tables
  ( hiraganaTable
  , katakanaTable
  , baseNumbers
  ) where

hiraganaTable :: [[(String, String)]]
hiraganaTable =
  [ [("あ", "a"), ("い", "i"), ("う", "u"), ("え", "e"), ("お", "o")]
  , [("か", "ka"), ("き", "ki"), ("く", "ku"), ("け", "ke"), ("こ", "ko")]
  , [("が", "ga"), ("ぎ", "gi"), ("ぐ", "gu"), ("げ", "ge"), ("ご", "go")]
  , [("さ", "sa"), ("し", "shi"), ("す", "su"), ("せ", "se"), ("そ", "so")]
  , [("ざ", "za"), ("じ", "ji"), ("ず", "zu"), ("ぜ", "ze"), ("ぞ", "zo")]
  , [("た", "ta"), ("ち", "chi"), ("つ", "tsu"), ("て", "te"), ("と", "to")]
  , [("だ", "da"), ("ぢ", "ji"), ("づ", "zu"), ("で", "de"), ("ど", "do")]
  , [("な", "na"), ("に", "ni"), ("ぬ", "nu"), ("ね", "ne"), ("の", "no")]
  , [("は", "ha"), ("ひ", "hi"), ("ふ", "fu"), ("へ", "he"), ("ほ", "ho")]
  , [("ば", "ba"), ("び", "bi"), ("ぶ", "bu"), ("べ", "be"), ("ぼ", "bo")]
  , [("ぱ", "pa"), ("ぴ", "pi"), ("ぷ", "pu"), ("ぺ", "pe"), ("ぽ", "po")]
  , [("ま", "ma"), ("み", "mi"), ("む", "mu"), ("め", "me"), ("も", "mo")]
  , [("や", "ya"), ("ゆ", "yu"), ("よ", "yo")]
  , [("ら", "ra"), ("り", "ri"), ("る", "ru"), ("れ", "re"), ("ろ", "ro")]
  , [("わ", "wa"), ("を", "wo")]
  , [("ん", "n")]
  ]

katakanaTable :: [[(String, String)]]
katakanaTable =
  [ [("ア", "a"), ("イ", "i"), ("ウ", "u"), ("エ", "e"), ("オ", "o")]
  , [("カ", "ka"), ("キ", "ki"), ("ク", "ku"), ("ケ", "ke"), ("コ", "ko")]
  , [("サ", "sa"), ("シ", "shi"), ("ス", "su"), ("セ", "se"), ("ソ", "so")]
  , [("タ", "ta"), ("チ", "chi"), ("ツ", "tsu"), ("テ", "te"), ("ト", "to")]
  , [("ナ", "na"), ("ニ", "ni"), ("ヌ", "nu"), ("ネ", "ne"), ("ノ", "no")]
  , [("ハ", "ha"), ("ヒ", "hi"), ("フ", "fu"), ("ヘ", "he"), ("ホ", "ho")]
  , [("マ", "ma"), ("ミ", "mi"), ("ム", "mu"), ("メ", "me"), ("モ", "mo")]
  , [("ヤ", "ya"), ("ユ", "yu"), ("ヨ", "yo")]
  , [("ラ", "ra"), ("リ", "ri"), ("ル", "ru"), ("レ", "re"), ("ロ", "ro")]
  , [("ワ", "wa"), ("ヲ", "wo")]
  , [("ン", "n")]
  ]

baseNumbers :: [(Int, String)]
baseNumbers =
  [ (1, "ichi")
  , (2, "ni")
  , (3, "san")
  , (4, "yon")
  , (5, "go")
  , (6, "roku")
  , (7, "nana")
  , (8, "hachi")
  , (9, "kyu")
  , (10, "juu")
  , (100, "hyaku")
  , (1000, "sen")
  , (10000, "man")
  ]
