
module Tables
  ( hiraganaTable
  , baseNumbers
  )
  where

hiraganaTable :: [[(String, String)]]
hiraganaTable =
  [ [ ("あ", "a")
    , ("い", "i")
    , ("う", "u")
    , ("え", "e")
    , ("お", "o")
    ]
  , [ ("か", "ka")
    , ("き", "ki")
    , ("く", "ku")
    , ("け", "ke")
    , ("こ", "ko")
    ]
  , [ ("が", "ga")
    , ("ぎ", "gi")
    , ("ぐ", "gu")
    , ("げ", "ge")
    , ("ご", "go")
    ]
  , [ ("さ", "sa")
    , ("し", "shi")
    , ("す", "su")
    , ("せ", "se")
    , ("そ", "so")
    ]
  , [ ("ざ", "za")
    , ("じ", "ji")
    , ("ず", "zu")
    , ("ぜ", "ze")
    , ("ぞ", "zo")
    ]
  , [ ("た", "ta")
    , ("ち", "chi")
    , ("つ", "tsu")
    , ("て", "te")
    , ("と", "to")
    ]
  , [ ("だ", "da")
    , ("ぢ", "ji")
    , ("づ", "zu")
    , ("で", "de")
    , ("ど", "do")
    ]
  , [ ("な", "na")
    , ("に", "ni")
    , ("ぬ", "nu")
    , ("ね", "ne")
    , ("の", "no")
    ]
  , [ ("は", "ha")
    , ("ひ", "hi")
    , ("ふ", "fu")
    , ("へ", "he")
    , ("ほ", "ho")
    ]
  , [ ("ば", "ba")
    , ("び", "bi")
    , ("ぶ", "bu")
    , ("べ", "be")
    , ("ぼ", "bo")
    ]
  , [ ("ぱ", "pa")
    , ("ぴ", "pi")
    , ("ぷ", "pu")
    , ("ぺ", "pe")
    , ("ぽ", "po")
    ]
  , [ ("ま", "ma")
    , ("み", "mi")
    , ("む", "mu")
    , ("め", "me")
    , ("も", "mo")
    ]
  , [ ("や", "ya")
    , ("ゆ", "yu")
    , ("よ", "yo")
    , ("ら", "ra")
    , ("り", "ri")
    ]
  , [ ("る", "ru")
    , ("れ", "re")
    , ("ろ", "ro")
    , ("わ", "wa")
    , ("を", "wo")
    ]
  , [ ("ん", "n/m")
    ]
  ]

baseNumbers :: [(Int, String)]
baseNumbers =
  [ (1, "ichi")
  , (2, "ni")
  , (3, "san")
  , (4, "shi") -- yon
  , (5, "go")
  , (6, "roku")
  , (7, "nana")
  , (8, "hachi")
  , (9, "kyu")
  , (10, "juu") 
  , (100, "hyaku")
  , (1000, "sen")
  , (10000, "man") -- actually ichiman but reasons
  ]


